benchmarks/logs/2026-04-30_std_http_while_true/burst_get_index.txt
Running 30s test @ http://localhost:8080/
  2 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   326.59us  122.90us   4.78ms   73.48%
    Req/Sec    15.25k     1.23k   17.23k    58.47%
  Latency Distribution
     50%  291.00us
     75%  395.00us
     90%  500.00us
     99%  692.00us
  913455 requests in 30.10s, 0.92GB read
Requests/sec:  30347.38
Transfer/sec:     31.43MB