benchmarks/logs/2026-04-30_std_http_while_true/soak_get_bookmarks.txt
Running 5m test @ http://localhost:8080/bookmarks
  1 threads and 4 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   774.23us  414.28us   5.51ms   62.38%
    Req/Sec     5.21k    68.79     5.34k    75.74%
  Latency Distribution
     50%  757.00us
     75%    1.11ms
     90%    1.36ms
     99%    1.74ms
  1556971 requests in 5.00m, 16.43GB read
Requests/sec:   5188.16
Transfer/sec:     56.06MB